Сервис цензурировнаия (проверки текста на бан-слова).

Работает в качестве самостоятельного сервиса цензурирования произвольного текста, а также в качестве микросервиса для цензурирования комментариев в составе
системы совместно с микросервисами ApiGateway, NewsAgg и Comments (см одноименные репозитории), которые имеют функциональность агрегатора новостей из rss лент,
маршрутизации запросов, компоновки новости и пользовательских комментариев к ней, а также добавления и хранения комментариев.

Реализованы:
 - проверка переданного в запросе текста на вхождение бан-слов из списка с помощью регулярных выражений
 - запрос для получения результатов проверки (положительный результат проверки: ответ со статусом 200 OK, найдено бан-слово: 400 BadRequest)
 - сквозной id запроса
 - логгирование результата обработки запроса